# SetMapOfSizesForStraights Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationNetworkChangeService..::..SetMapOfSizesForStraights Method
FabricationNetworkChangeService Class See Also
---
Set the mapping for sizes of fabrication part straights to change the sizes to.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public void SetMapOfSizesForStraights(
	ISet<FabricationPartSizeMap> fabricationPartSizeMaps
)
```

Visual Basic
---
```text
Public Sub SetMapOfSizesForStraights ( _
	fabricationPartSizeMaps As ISet(Of FabricationPartSizeMap) _
)
```

Visual C++
---
```text
public:
void SetMapOfSizesForStraights(
	ISet<FabricationPartSizeMap^>^ fabricationPartSizeMaps
)
```

# ### Parameters
fabricationPartSizeMaps
    Type: System.Collections.Generic..::..ISet<(Of <(<'FabricationPartSizeMap>)>)> The map containing the original straights size to the mapped sizes.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace